<h2 style="display: none;">本WEBサイトについて</h2>
    <h3 class="h3">目的</h3>
        <P>
          本WEBサイトの目的は、明治大学理工学部機械情報工学科1年次に履修する、材料力学1・演習の補助である。<br />
          また、これから材料力学を学ぶ人への導入、もしくは既に学んだ人の概念的理解度を深めるためにも使っていただける幸いである。
        </P>
        <p>
          また教科書ではなくWEBサイトということもあり、通学時間や空いた時間に疑問を解消・知識をインプットできるような設計にした。
        </p>
    <h3 class="h3">本サイトの構成</h3>
        <p>
            本WEBサイトは、材料力学1・演習で使用している教科書をもとに構成されている。
            また内容については、授業中に学ぶ5章、
            材料力学を学ぶとは？・応力とひずみ・引張と圧縮・軸のねじり・はりの曲げ
            をピックアップして記載する。
        </p>
